RESULTS_BARE/redis_bare_20251108-2110.txt
=== 2025-11-08 21:10:20 — workload=redis env=bare run=6/7 ===
$ memtier_benchmark -s 192.168.1.149 -p 6379 --ratio=1:10 -t 4 -c 50 -d 64 -n 500000
4         Threads
50        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         2594.99          ---          ---       151.02361         6.81500        23.55100        90.11100       281.00 
Gets        25949.65       120.23     25829.42       151.22085         6.81500        23.67900        90.11100      1018.58 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      28544.64       120.23     25829.42       151.20292         6.81500        23.67900        90.11100      1299.59 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.383        0.000
SET       4.735        5.000
SET       5.791       10.000
SET       6.271       15.000
SET       6.431       20.000
SET       6.527       25.000
SET       6.591       30.000
SET       6.655       35.000
SET       6.719       40.000
SET       6.751       45.000
SET       6.815       50.000
SET       6.847       52.500
SET       6.879       55.000
SET       6.911       57.500
SET       6.943       60.000
SET       7.007       62.500
SET       7.071       65.000
SET       7.167       67.500
SET       7.359       70.000
SET       7.743       72.500
SET       8.031       75.000
SET       8.159       76.250
SET       8.319       77.500
SET       8.447       78.750
SET       8.575       80.000
SET       8.703       81.250
SET       8.831       82.500
SET       8.959       83.750
SET       9.087       85.000
SET       9.279       86.250
SET       9.791       87.500
SET       9.983       88.125
SET      10.047       88.750
SET      10.175       89.375
SET      10.239       90.000
SET      10.303       90.625
SET      10.303       91.250
SET      10.367       91.875
SET      10.431       92.500
SET      10.495       93.125
SET      10.559       93.750
SET      10.623       94.062
SET      10.623       94.375
SET      10.687       94.688
SET      10.751       95.000
SET      10.815       95.312
SET      11.007       95.625
SET      11.327       95.938
SET      11.775       96.250
SET      12.159       96.562
SET      12.415       96.875
SET      12.543       97.031
SET      12.671       97.188
SET      12.799       97.344
SET      12.927       97.500
SET      13.055       97.656
SET      13.311       97.812
SET      13.887       97.969
SET      14.655       98.125
SET      15.615       98.281
SET      16.895       98.438
SET      17.663       98.516
SET      18.431       98.594
SET      19.199       98.672
SET      19.967       98.750
SET      20.607       98.828
SET      21.759       98.906
SET      23.295       98.984
SET      25.087       99.062
SET      27.263       99.141
SET      29.951       99.219
SET      31.487       99.258
SET      33.023       99.297
SET      34.559       99.336
SET      36.095       99.375
SET      37.887       99.414
SET      39.679       99.453
SET      41.983       99.492
SET      44.287       99.531
SET      47.103       99.570
SET      49.919       99.609
SET      51.199       99.629
SET      52.735       99.648
SET      54.015       99.668
SET      55.295       99.688
SET      57.087       99.707
SET      58.879       99.727
SET      61.183       99.746
SET      63.743       99.766
SET      66.559       99.785
SET      69.119       99.805
SET      70.143       99.814
SET      71.679       99.824
SET      73.215       99.834
SET      75.263       99.844
SET      77.823       99.854
SET      80.383       99.863
SET      82.943       99.873
SET      84.991       99.883
SET      87.551       99.893
SET      90.623       99.902
SET      92.671       99.907
SET      94.719       99.912
SET      96.767       99.917
SET     100.351       99.922
SET     103.423       99.927
SET     106.495       99.932
SET     109.567       99.937
SET     114.175       99.941
SET     120.319       99.946
SET     125.439       99.951
SET     128.511       99.954
SET     132.095       99.956
SET     136.191       99.958
SET     139.263       99.961
SET     145.407       99.963
SET     151.551       99.966
SET     160.767       99.968
SET     174.079       99.971
SET     209.919       99.973
SET     315.391       99.976
SET    603979.750       99.977
SET    603979.750      100.000
---
GET       0.351        0.000
GET       4.735        5.000
GET       5.791       10.000
GET       6.271       15.000
GET       6.431       20.000
GET       6.527       25.000
GET       6.591       30.000
GET       6.655       35.000
GET       6.719       40.000
GET       6.751       45.000
GET       6.815       50.000
GET       6.847       52.500
GET       6.879       55.000
GET       6.911       57.500
GET       6.943       60.000
GET       7.007       62.500
GET       7.039       65.000
GET       7.167       67.500
GET       7.359       70.000
GET       7.711       72.500
GET       7.999       75.000
GET       8.159       76.250
GET       8.319       77.500
GET       8.447       78.750
GET       8.575       80.000
GET       8.639       81.250
GET       8.767       82.500
GET       8.959       83.750
GET       9.087       85.000
GET       9.279       86.250
GET       9.791       87.500
GET       9.919       88.125
GET      10.047       88.750
GET      10.111       89.375
GET      10.239       90.000
GET      10.239       90.625
GET      10.303       91.250
GET      10.367       91.875
GET      10.431       92.500
GET      10.495       93.125
GET      10.559       93.750
GET      10.559       94.062
GET      10.623       94.375
GET      10.687       94.688
GET      10.751       95.000
GET      10.815       95.312
GET      10.943       95.625
GET      11.263       95.938
GET      11.711       96.250
GET      12.159       96.562
GET      12.415       96.875
GET      12.543       97.031
GET      12.671       97.188
GET      12.735       97.344
GET      12.863       97.500
GET      13.055       97.656
GET      13.311       97.812
GET      13.823       97.969
GET      14.591       98.125
GET      15.615       98.281
GET      16.895       98.438
GET      17.663       98.516
GET      18.431       98.594
GET      19.199       98.672
GET      19.967       98.750
GET      20.607       98.828
GET      21.759       98.906
GET      23.295       98.984
GET      25.087       99.062
GET      27.263       99.141
GET      29.951       99.219
GET      31.487       99.258
GET      33.279       99.297
GET      34.815       99.336
GET      36.351       99.375
GET      37.887       99.414
GET      39.679       99.453
GET      41.983       99.492
GET      44.287       99.531
GET      47.103       99.570
GET      49.919       99.609
GET      51.199       99.629
GET      52.479       99.648
GET      54.015       99.668
GET      55.295       99.688
GET      57.087       99.707
GET      59.135       99.727
GET      61.439       99.746
GET      63.743       99.766
GET      66.559       99.785
GET      69.119       99.805
GET      70.655       99.814
GET      71.679       99.824
GET      73.727       99.834
GET      75.775       99.844
GET      78.335       99.854
GET      80.895       99.863
GET      82.943       99.873
GET      85.503       99.883
GET      88.063       99.893
GET      91.135       99.902
GET      93.183       99.907
GET      95.231       99.912
GET      97.279       99.917
GET     100.863       99.922
GET     103.935       99.927
GET     106.495       99.932
GET     110.079       99.937
GET     114.687       99.941
GET     120.319       99.946
GET     125.439       99.951
GET     128.511       99.954
GET     132.095       99.956
GET     136.191       99.958
GET     139.263       99.961
GET     145.407       99.963
GET     151.551       99.966
GET     160.767       99.968
GET     176.127       99.971
GET     216.063       99.973
GET     387.071       99.976
GET    603979.750       99.977
GET    603979.750      100.000
---
WAIT      0.000      100.000
=== end ===